tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "heroku/brew"
tap "nodenv/nodenv"
tap "ouchxp/nodenv"
brew "mas"


# Browsers
cask "firefox"
cask "firefox-nightly"
cask "google-chrome"
cask "google-chrome-canary"
cask "safari-technology-preview"
cask "vivaldi"

# Office Utilities
cask "thunderbird"
cask "slack"
cask "box-drive"
cask "mendeley"
cask "bitwarden"
cask "meetingbar"
cask "inkdrop"
cask "licecap"
cask "pritunl"
cask "expressvpn"
cask "miro"
cask "figma"
cask "gather"
mas "Letterspace", id: 950145466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Pocket", id: 568494494

# Programming
brew "pyenv"
brew "tfenv"
brew "cloc"
brew "heroku/brew/heroku"
brew "svn"
brew "git"
brew "hub"
brew "gh"
brew "go"
brew "lua"
brew "dep"
brew "yarn"
brew "jq"
brew "helm"
brew "wrk"
brew "bufbuild/buf/buf"
cask "font-source-code-pro-for-powerline"
cask "iterm2"
cask "visual-studio-code"
cask "docker"
cask "virtualbox"
cask "xquartz"
cask "java"
cask "android-platform-tools"
cask "db-browser-for-sqlite"
mas "XCode", id: 497799835

# Graphics
brew "imagemagick"
brew "ffmpeg"
cask "skitch"
cask "gimp"

# Utilities
brew "coreutils"
brew "grep"
brew "gnu-sed"
brew "the_silver_searcher"
brew "terminal-notifier"
brew "wine"
brew "winetricks"
brew "dnscrypt-proxy"
brew "tldr"
brew "tree"
brew "ifstat"
brew "direnv"
cask "accessmenubarapps"
cask "xbar"
cask "bettertouchtool"
cask "karabiner-elements"
cask "yujitach-menumeters"
cask "clipy"
cask "grandperspective"
cask "onyx"
cask "the-unarchiver"
mas "Battery Health 2", id: 1120214373

# QuickLook plugins
cask "qlimagesize"
cask "emin-webpquicklook"
cask "quicklook-csv"
cask "quicklook-json"
cask "qlstephen"
cask "qlcolorcode"
cask "qlmarkdown"
cask "betterzip"

# Entertainment
cask "vlc"
cask "amazon-music"
cask "bathyscaphe"
cask "kindle"
cask "blu-ray-player"
mas "LINE", id: 539883307
mas "TweetDeck", id: 485812721
