tap "homebrew/autoupdate"
tap "heroku/brew"
tap "bufbuild/buf"
brew "mas"

# Browsers
cask "firefox"
cask "google-chrome"
cask "safari-technology-preview"
cask "vivaldi"

# Programming
brew "cloc"
brew "heroku/brew/heroku"
brew "git"
brew "gh"
brew "falco"
brew "lua"
brew "yarn"
brew "pnpm"
brew "jq"
brew "helm"
brew "wrk"
brew "bufbuild/buf/buf"
brew "actionlint"
brew "shellcheck"
brew "mkcert"
brew "awscli"
cask "gcloud-cli"
cask "figma"
cask "font-source-code-pro-for-powerline"
cask "visual-studio-code"
cask "virtualbox"
cask "android-platform-tools"
cask "db-browser-for-sqlite"
cask "proxyman"
cask "docker-desktop"

# Media
brew "imagemagick"
brew "ffmpeg"
brew "svgo"
cask "gimp"

# Utilities
brew "coreutils"
brew "moreutils"
brew "grep"
brew "gnu-sed"
brew "the_silver_searcher"
brew "terminal-notifier"
brew "tldr"
brew "tree"
brew "ifstat"
brew "direnv"
brew "noti"
brew "mise"
cask "box-drive"
cask "bitwarden"
cask "meetingbar"
cask "protonvpn"
cask "xbar"
cask "karabiner-elements"
cask "clipy"
cask "the-unarchiver"
cask "grandperspective"
mas "Letterspace", id: 950145466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694

# QuickLook plugins
cask "qlvideo"
cask "qlstephen"
cask "betterzip"

# Entertainment
cask "vlc"
cask "amazon-music"
cask "spotify"
cask "bathyscaphe"
cask "kindle"
cask "blu-ray-player"

# Communication
cask "slack"
cask "discord"
mas "LINE", id: 539883307
